{"id": "15970", "productDisplayName": "Turtle Check Men Navy Blue Shirt", "gender": "Men", "articleType": "Shirts", "title": "Stylish Navy Blue Turtle Check Shirt for Men", "description": "Elevate your casual wardrobe with the Turtle Check Men Navy Blue Shirt. Crafted from high-quality cotton fabric, this shirt offers both comfort and style, making it perfect for any occasion. The unique navy blue and white check pattern adds a contemporary touch, allowing you to stand out effortlessly. With a tailored fit and short sleeves, it provides optimal breathability during warm days. Whether you're heading to the office or enjoying a weekend outing, this shirt pairs beautifully with jeans or chinos. The button-down collar and neat stitching enhance its polished look, making it a versatile addition to your collection. Upgrade your style with this must-have staple!", "features": ["Stylish navy blue and white check pattern", "High-quality cotton fabric for comfort", "Tailored fit for a modern silhouette", "Short sleeves for breathable wear", "Button-down collar for a polished look", "Versatile for both casual and semi-formal occasions", "Easy to pair with jeans or chinos"], "keywords": "navy blue shirt, men's check shirt, stylish shirt, casual wear, short sleeve shirt, cotton shirt, button-down shirt, summer shirt, trendy men's fashion, versatile shirts", "status": "ok", "error": ""}
{"id": "39386", "productDisplayName": "Peter England Men Party Blue Jeans", "gender": "Men", "articleType": "Jeans", "title": "Peter England Men Party Blue Jeans – Stylish & Comfortable", "description": "Step out in style with the Peter England Men Party Blue Jeans, designed meticulously for the modern man. Crafted from premium-quality denim, these jeans offer durability without compromising on comfort. The rich blue hue and subtle faded details provide a trendy, relaxed vibe, perfect for any casual or semi-formal occasion. The classic five-pocket design enhances functionality, while the tailored fit flatters your silhouette. Pair them effortlessly with a shirt or a tee for a smart-casual look that turns heads. Whether it’s a night out with friends or a family gathering, these jeans ensure you feel confident and stylish all day long.", "features": ["Premium quality denim for durability and comfort", "Trendy blue hue with subtle faded details", "Classic five-pocket design for practicality", "Tailored fit enhances your body shape", "Versatile for casual and semi-formal occasions", "Easy to pair with various outfits", "Machine washable for easy care"], "keywords": "Peter England, men jeans, blue jeans, party wear, stylish jeans, comfortable denim, modern fit, durable jeans, casual wear, men's fashion, trendy denim, semi-formal attire", "status": "ok", "error": ""}
{"id": "59263", "productDisplayName": "Titan Women Silver Watch", "gender": "Women", "articleType": "Watches", "title": "Titan Women Silver Watch - Elegance Redefined", "description": "Elevate your style with the Titan Women Silver Watch, a perfect blend of sophistication and functionality. Featuring a sleek silver stainless steel strap and a minimalist round dial, this timepiece is designed for the modern woman who values both elegance and practicality. The luminous hands effortlessly glide over the chic white face, ensuring easy readability for any occasion. Whether dressing up for a formal event or accessorizing with casual attire, this watch adds a touch of glamour to your ensemble. With its durable construction, you can trust that it will be a reliable companion for years to come. Experience the perfect harmony of classic design and contemporary flair with the Titan Women Silver Watch.", "features": ["Stainless steel strap for durability", "Minimalist white dial for easy readability", "Luminous hands for low-light visibility", "Water-resistant design for everyday wear", "Perfect for casual or formal occasions", "Lightweight and comfortable fit", "Elegant gift option for special occasions"], "keywords": "Titan watch, women silver watch, elegant timepiece, stainless steel watch, minimalist watch, fashion watch, luxury watch, women's accessories, dress watch, reliable wristwatch", "status": "ok", "error": ""}
{"id": "21379", "productDisplayName": "Manchester United Men Solid Black Track Pants", "gender": "Men", "articleType": "Track Pants", "title": "Manchester United Men's Solid Black Track Pants", "description": "Elevate your athletic wardrobe with the Manchester United Men's Solid Black Track Pants. Crafted from high-quality, breathable fabric, these track pants offer unparalleled comfort and flexibility, making them perfect for both training sessions and casual outings. The sleek black design features an embroidered Manchester United crest, showcasing your unwavering support for the club. With a relaxed fit and an elastic waistband, they provide a snug yet comfortable feel. Ideal for pairing with your favorite jersey or tee, these track pants are not only functional but also stylish. Whether you're on the pitch or lounging at home, these track pants ensure you stay comfortable and fashionable. Make a statement with every step you take!", "features": ["Made from breathable, lightweight fabric", "Embroidered Manchester United crest", "Elastic waistband for a secure fit", "Relaxed fit for comfort during workouts", "Stylish black design for versatile wear", "Side pockets for convenient storage", "Durable construction for long-lasting wear"], "keywords": "Manchester United, men's track pants, black track pants, athletic wear, sportswear, comfortable pants, breathable fabric, casual wear, embroidered logo, elastic waistband", "status": "ok", "error": ""}
{"id": "53759", "productDisplayName": "Puma Men Grey T-shirt", "gender": "Men", "articleType": "Tshirts", "title": "Stylish Puma Men's Grey T-Shirt for Everyday Wear", "description": "Elevate your casual wardrobe with the Puma Men Grey T-shirt, the perfect blend of style and comfort. Made from 100% premium cotton, this T-shirt offers a soft, breathable feel that keeps you comfortable all day long. The classic grey color is versatile, making it easy to pair with any outfit, whether you're hitting the gym or hanging out with friends. Featuring the iconic Puma logo, this shirt not only delivers top-notch functionality but also showcases your trendy fashion sense. Its modern fit flatters every body type, while the short sleeves and crew neckline provide easy movement. Ideal for layering or wearing solo, this T-shirt is a must-have staple for any man’s wardrobe.", "features": ["Crafted from 100% premium cotton for soft comfort", "Stylish grey color, versatile for any occasion", "Iconic Puma logo for a sporty look", "Modern fit enhances body shape", "Breathable fabric for all-day wear", "Short sleeves for easy movement", "Easy to care for – machine washable"], "keywords": "Puma T-shirt, men's fashion, casual wear, grey T-shirt, cotton shirt, stylish tee, breathable fabric, athletic apparel, everyday clothing, versatile T-shirt", "status": "ok", "error": ""}
{"id": "1855", "productDisplayName": "Inkfruit Mens Chain Reaction T-shirt", "gender": "Men", "articleType": "Tshirts", "title": "Inkfruit Men's Chain Reaction T-shirt - Be Fearless!", "description": "Elevate your casual wardrobe with the Inkfruit Men's Chain Reaction T-shirt. Crafted from premium cotton, this t-shirt ensures ultimate comfort while making a bold statement. Featuring a vibrant logo design that stands out against a soft grey background, it combines style with versatility. Whether you're hitting the gym, running errands, or hanging out with friends, this tee is the perfect companion. The classic fit allows for easy layering and a flattering silhouette, making it a staple piece for any man's collection. Embrace the chain reaction and showcase your unique style!", "features": ["Made from high-quality, breathable cotton", "Eye-catching logo design in vibrant colors", "Soft grey fabric for a versatile look", "Classic fit for comfort and style", "Ideal for casual outings or everyday wear", "Easy to care for and durable", "Available in multiple sizes"], "keywords": "men's t-shirt, casual wear, cotton t-shirt, stylish tee, comfortable t-shirt, Inkfruit, graphic tee, trendy apparel, versatile t-shirt, everyday wear", "status": "ok", "error": ""}
{"id": "30805", "productDisplayName": "Fabindia Men Striped Green Shirt", "gender": "Men", "articleType": "Shirts", "title": "Fabindia Striped Green Shirt for Men - Stylish & Comfortable", "description": "Elevate your wardrobe with the Fabindia Men Striped Green Shirt, a perfect blend of style and comfort. Crafted from premium cotton, this shirt features a vibrant green hue highlighted by subtle stripes that add depth and character. The classic collar and button-up design ensure versatility, making it suitable for both casual outings and semi-formal occasions. The breathable fabric keeps you cool and comfortable throughout the day, while the relaxed fit allows for easy movement. Pair it with jeans or chinos for a polished look that's effortlessly chic. Embrace a contemporary take on timeless style with this must-have addition to your closet.", "features": ["Premium cotton fabric for ultimate comfort", "Stylish green color with elegant stripes", "Classic collar and button-up design", "Relaxed fit for ease of movement", "Versatile for casual and semi-formal occasions", "Breathable fabric perfect for all-day wear", "Easy to pair with jeans, chinos, or shorts"], "keywords": "Fabindia, men's shirt, striped shirt, green shirt, casual wear, cotton shirt, stylish shirt, breathable fabric, relaxed fit, versatile clothing", "status": "ok", "error": ""}
{"id": "26960", "productDisplayName": "Jealous 21 Women Purple Shirt", "gender": "Women", "articleType": "Shirts", "title": "Chic Jealous 21 Women's Purple Shirt for Every Occasion", "description": "Elevate your wardrobe with the Jealous 21 Women Purple Shirt. This stylish top features a rich, vibrant purple hue that adds a pop of color to any outfit, perfect for moving seamlessly from day to night. Crafted from soft, breathable fabric, it ensures utmost comfort while maintaining a polished look. The relaxed fit and chic short sleeves provide flattering coverage, making it ideal for both casual outings and professional settings. Pair it with your favorite jeans or a tailored skirt for a versatile ensemble that turns heads. Make a statement with this must-have addition to your collection!", "features": ["Vibrant purple color for a bold look", "Soft, breathable fabric for all-day comfort", "Chic short sleeves offering effortless style", "Relaxed fit that flatters various body types", "Versatile design suitable for casual and professional wear", "Easy to style with jeans, skirts, or trousers", "Durable and easy to care for, maintaining its vibrant color"], "keywords": "women's purple shirt, Jealous 21, stylish women tops, casual women's wear, chic shirts for women, short sleeve shirts, comfortable work shirts, trendy women fashion, versatile women's clothing, everyday outfits", "status": "ok", "error": ""}
{"id": "29114", "productDisplayName": "Puma Men Pack of 3 Socks", "gender": "Men", "articleType": "Socks", "title": "Puma Men Pack of 3 Stylish Performance Socks", "description": "Step up your sock game with the Puma Men Pack of 3 Socks! Crafted for comfort and style, this pack features three pairs of sleek black socks with a stylish contrast stripe and the iconic Puma logo. Made from a blend of high-quality materials, these socks ensure breathability and durability, perfect for daily wear or intense workouts. The cushioned design provides support and reduces friction, making them ideal for athletic activities or lounging at home. Whether you're hitting the gym or conquering the streets, these socks will keep your feet fresh and comfortable all day long. Upgrade your essentials with this fashionable pack!", "features": ["Pack of 3 high-performance socks", "Cushioned design for maximum comfort", "Durable fabric blend for long-lasting wear", "Breathable material to keep feet fresh", "Stylish black color with contrasting stripe", "Iconic Puma logo for a sporty look", "Perfect for workouts or casual wear"], "keywords": "Puma socks, men's socks, performance socks, athletic socks, cushioned socks, black socks, breathable socks, stylish socks, pack of 3 socks, casual wear", "status": "ok", "error": ""}
{"id": "30039", "productDisplayName": "Skagen Men Black Watch", "gender": "Men", "articleType": "Watches", "title": "Sleek Skagen Men’s Black Watch - Modern Elegance", "description": "Discover timeless sophistication with the Skagen Men's Black Watch, designed for the modern man who values style and functionality. This minimalist timepiece features a sleek all-black design, making it perfect for both casual and formal occasions. The durable silicone band not only ensures a comfortable fit but is also water-resistant, allowing you to wear it worry-free. The striking black watch face features distinct hour markers and subtle, minimalist hands, giving it a refined yet bold look. Whether you're dressing up for a meeting or heading out for the weekend, this watch effortlessly elevates your outfit. Invest in a piece that combines classic aesthetics with modern craftsmanship for an accessory that stands the test of time.", "features": ["Sleek all-black design for timeless elegance", "Durable silicone band for comfort", "Water-resistant for everyday wear", "Minimalist watch face with clear hour markers", "Versatile for both casual and formal settings", "Lightweight construction for easy wear", "Quartz movement for accurate timekeeping"], "keywords": "Skagen watch, men's watch, black watch, minimalist watch, silicone watch, water-resistant watch, stylish timepiece, elegant men's accessories, fashion watches", "status": "ok", "error": ""}
